Revit 2024 API
BuildingPadType Class
 Represents a specific type of Building Pad.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class BuildingPadType : HostObjAttributes
Visual Basic
Public Class BuildingPadType _
	Inherits HostObjAttributes
Visual C++
public ref class BuildingPadType : public HostObjAttributes
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.BuildingPadType
See Also
BuildingPadType Members
Autodesk.Revit.DB Namespace